// ЗАДАЧА 05. Написать программу вычисления значения функции y=f(a)

//Мое решение
// int f (int a)
// {
//     int y = a;
//     return (y*y);
// }

// int a = 5;
// Console.WriteLine(f(a));


//Решение от преподавателя
double Y(double x)
{
    return x*x;
}

Console.WriteLine(Y(2));