// ЗАДАЧА 05. Написать программу вычисления значения функции y=f(a)
int f (int a)
{
    int y = a;
    return y;
}

int a = 5;
Console.WriteLine(f(a));